content/about.md
+++
title = "About Me"
author = ["Rodrigo Machuca"]
description = "org-mode markup content to be parsed and rendered into CommonMarkdown by ox-hugo"
date = 2020-09-04T23:40:00-05:00
draft = false
+++

This is the content of my about page.

Hello!

I'm Rodrigo Machuca, a Linux geek, coffee drinker, video game enthusiast, wanna
be bass player and TV series cruncher (animated sitcoms, sci-fi, shounen anime).

Born and raised in [León, Guanajuato. México](https://en.wikipedia.org/wiki/Le%C3%B3n,%5FGuanajuato). I have been attracted into
tinkering and trying to understand how do things click since the beginning of my
childhood... _even when that meant to fully disassemble my own crib at small
age!_

When I was around 8 years old I got contact with what would become one of the
most important artifacts in my formation: [The Atari 2600](https://en.wikipedia.org/wiki/Atari%5F2600) console. I was just
amazed on how much could be done just by _having the control_ to move pixels. It
felt empowering and interactive. Later, during my primary school I got
introduced to my first computer: The [Power Macintosh 5200](https://en.wikipedia.org/wiki/Power%5FMacintosh%5F5200%5FLC). Although not the most
recognizable model from the Mac family, being a curious youngster it checked all
my boxes: point, click and interact! My personal interest in electronics
skyrocketed after that and it was not long before I was begging my mom to get my
own for my personal use (homework and studying of course). She was hesitant as
we had really constrained economic power; but after some persuasion and
reference data, we could get a "franki-machine", a computer built from some
scraping materials from my mom job network. It did not take long to install it
one of the most influencial games in my life, [Age of Empires II](https://en.wikipedia.org/wiki/Age%5Fof%5FEmpires%5FII), and the
snowballing effect of video games, computers and trying to understand them (even
if just to be able to play with my friend online) spiraled and got me into this
exiting never ending rabbit hole.

Nowadays, after finishing my **Computer Systems Engineering** bachelor degree,
have had the opportunity to work in a variety of radical different industries,
including _Banking, Video Games, Web Hosting and Google_
